## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 2 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                              NAME                                                              |
|----------|--------------------------------------------------------------------------------------------------------------------------------|
| delete   | `aws_ecs_cluster.saas_procurement`                                                                                             |
| update   | `aws_security_group.ecs_tasks`                                                                                                 |
|          | `module.saas_procurement.aws_iam_policy.this_task_exec`                                                                        |
| recreate | `module.saas_procurement.aws_cloudwatch_log_group.this`                                                                        |
|          | `module.saas_procurement.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0]`                                    |
|          | `module.saas_procurement.aws_ecs_service.this`                                                                                 |
|          | `module.saas_procurement.aws_ecs_task_definition.this`                                                                         |
|          | `module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecs_cluster.saas_procurement will be destroyed
  # (because aws_ecs_cluster.saas_procurement is not in configuration)
  - resource "aws_ecs_cluster" "saas_procurement" {
      - arn                = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - capacity_providers = [
          - "FARGATE",
        ] -> null
      - id                 = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - name               = "saas-procurement-cluster" -> null
      - tags               = {
          - "CostCentre" = "saas-procurement"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "saas-procurement"
          - "Terraform"  = "true"
        } -> null

      - default_capacity_provider_strategy {
          - base              = 1 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 1 -> null
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Allow ECS to talk to the RDS cluster"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-051638cd60aef88c3",
                ]
              - self             = false
              - to_port          = 5432
            },
            # (1 unchanged element hidden)
        ]
        id                     = "sg-0d1ca7e7e561a219f"
        name                   = "saas-procurement-security-group"
        tags                   = {
            "CostCentre" = "saas-procurement"
        }
        # (7 unchanged attributes hidden)
    }

  # module.saas_procurement.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = ""
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.saas_procurement.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.saas_procurement.aws_cloudwatch_log_group.this must be replaced
-/+ resource "aws_cloudwatch_log_group" "this" {
      ~ arn               = "arn:aws:logs:ca-central-1:394954348146:log-group:/aws/ecs/saas-procurement-cluster" -> (known after apply)
      ~ id                = "/aws/ecs/saas-procurement-cluster" -> (known after apply)
      ~ name              = "/aws/ecs/saas-procurement-cluster" -> "/aws/ecs/saas-procurement-cluster/saas-procurement-app-service" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # module.saas_procurement.aws_cloudwatch_log_subscription_filter.this_sentinel_forwarder[0] must be replaced
-/+ resource "aws_cloudwatch_log_subscription_filter" "this_sentinel_forwarder" {
      ~ id              = "cwlsf-117549908" -> (known after apply)
      ~ log_group_name  = "/aws/ecs/saas-procurement-cluster" -> "/aws/ecs/saas-procurement-cluster/saas-procurement-app-service" # forces replacement
        name            = "All cluster logs"
      + role_arn        = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.saas_procurement.aws_ecs_service.this must be replaced
-/+ resource "aws_ecs_service" "this" {
      ~ cluster                            = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> "saas-procurement-cluster" # forces replacement
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:394954348146:service/saas-procurement-cluster/saas-procurement-app-service" -> (known after apply)
        name                               = "saas-procurement-app-service"
        tags                               = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:19" -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (12 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

        # (3 unchanged blocks hidden)
    }

  # module.saas_procurement.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task:19" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:394954348146:task-definition/saas-procurement-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  ~ logConfiguration       = {
                      ~ options   = {
                          ~ awslogs-group         = "/aws/ecs/saas-procurement-cluster" -> "/aws/ecs/saas-procurement-cluster/saas-procurement-app-service"
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                  - mountPoints            = []
                    name                   = "saas-procurement"
                  - volumesFrom            = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "saas-procurement-task" -> (known after apply)
      ~ revision                 = 19 -> (known after apply)
        tags                     = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.saas_procurement.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id        = "arn:aws:iam::394954348146:policy/saas-procurement-task_ecs_task_exec_policy"
        name      = "saas-procurement-task_ecs_task_exec_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:394954348146:log-group:/aws/ecs/saas-procurement-cluster:*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_permission.sentinel_forwarder_cloudwatch_log_subscription[0] must be replaced
-/+ resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription" {
      ~ id                  = "AllowExecutionFromCloudWatchLogs-saas-procurement-cluster-0" -> (known after apply)
      ~ source_arn          = "arn:aws:logs:ca-central-1:394954348146:log-group:/aws/ecs/saas-procurement-cluster:*" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
